#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.private_dns_zone_key_vault.data.modtm_module_source.telemetry[0]: Reading...
module.bastion_host.data.modtm_module_source.telemetry[0]: Reading...
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Reading...
module.network_security_group.data.modtm_module_source.telemetry[0]: Reading...
module.bastion_host_public_ip.data.modtm_module_source.telemetry[0]: Reading...
module.virtual_network.data.modtm_module_source.telemetry[0]: Reading...
module.user_assigned_managed_identity.data.modtm_module_source.telemetry[0]: Reading...
module.avm-utl-network-ip-addresses.data.modtm_module_source.telemetry[0]: Reading...
module.bastion_host_public_ip.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.private_dns_zone_key_vault.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.avm-utl-network-ip-addresses.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.network_security_group.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.user_assigned_managed_identity.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.bastion_host.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.virtual_network.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.key_vault.data.modtm_module_source.telemetry[0]: Reading...
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.nat_gateway.data.modtm_module_source.telemetry[0]: Reading...
module.resource_group.data.modtm_module_source.telemetry[0]: Reading...
module.resource_group.random_uuid.telemetry[0]: Refreshing state... [id=405f479e-6845-d3e5-ff6c-77231f52d77d]
module.resource_group.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.private_dns_zone_storage_account.data.modtm_module_source.telemetry[0]: Reading...
module.key_vault.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.nat_gateway.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.storage_account.data.modtm_module_source.telemetry[0]: Reading...
module.private_dns_zone_storage_account.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.virtual_network.random_uuid.telemetry[0]: Refreshing state... [id=7df2e24b-8eb4-dc0d-f076-d7c35b8987fb]
module.nat_gateway.random_uuid.telemetry[0]: Refreshing state... [id=9aef6c77-9d82-3923-e00b-0410dfe8a97d]
module.storage_account.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.log_analytics_workspace.random_uuid.telemetry[0]: Refreshing state... [id=95f09b6f-b3d1-d0c7-1969-1bf6eb79264a]
module.network_security_group.random_uuid.telemetry[0]: Refreshing state... [id=fc149ef6-a27b-f35b-d957-04a1ee0430cb]
module.avm-utl-network-ip-addresses.random_uuid.telemetry[0]: Refreshing state... [id=13188490-d660-8985-b00a-393ff1ac409e]
module.avm-utl-network-ip-addresses.data.azapi_client_config.telemetry[0]: Reading...
module.avm-utl-network-ip-addresses.data.azapi_client_config.telemetry[0]: Read complete after 0s [id=clientConfigs/subscriptionId=1ab5dc89-603c-4f45-bdd1-a4231369b400;tenantId=da1aa744-f43d-46fd-8308-5a3f6b99452a]
module.avm-utl-network-ip-addresses.modtm_telemetry.telemetry[0]: Refreshing state... [id=d1c9bcf4-c247-472d-929b-119d2d4c852b]
module.network_security_group.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.data.azurerm_subscription.current: Reading...
data.azurerm_client_config.current: Reading...
module.user_assigned_managed_identity.data.azurerm_client_config.telemetry[0]: Reading...
module.user_assigned_managed_identity.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.network_security_group.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.bastion_host.data.azurerm_client_config.telemetry[0]: Reading...
module.virtual_network.data.azurerm_client_config.this: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.private_dns_zone_storage_account.data.azurerm_client_config.telemetry[0]: Reading...
module.private_dns_zone_key_vault.data.azurerm_client_config.telemetry[0]: Reading...
module.nat_gateway.data.azurerm_client_config.telemetry[0]: Reading...
module.storage_account.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.data.azurerm_client_config.telemetry[0]: Reading...
module.storage_account.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.virtual_network.data.azurerm_client_config.telemetry[0]: Reading...
module.private_dns_zone_key_vault.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.virtual_network.data.azurerm_client_config.this: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Reading...
module.private_dns_zone_storage_account.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.nat_gateway.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.bastion_host.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.resource_group.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.virtual_network.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.nat_gateway.modtm_telemetry.telemetry[0]: Refreshing state... [id=f9448316-e9fe-4afa-a29e-a3080931b299]
module.bastion_host_public_ip.data.azurerm_client_config.telemetry[0]: Reading...
module.bastion_host_public_ip.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.key_vault.data.azurerm_client_config.telemetry[0]: Reading...
module.key_vault.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev]
module.network_security_group.modtm_telemetry.telemetry[0]: Refreshing state... [id=e07a8f89-f236-4798-8de6-03ebc84929e3]
module.resource_group.modtm_telemetry.telemetry[0]: Refreshing state... [id=f982df00-7cc2-4fe3-a34f-4e97d500e2ce]
module.virtual_network.modtm_telemetry.telemetry[0]: Refreshing state... [id=b26b01ca-8b9e-4532-be56-215ba0f1e5f2]
module.log_analytics_workspace.modtm_telemetry.telemetry[0]: Refreshing state... [id=8ee01287-a949-48f2-a15c-3891c494a8fa]
module.resource_group.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400]
module.network_security_group.azurerm_network_security_group.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev]
module.virtual_network.azapi_resource.vnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev]
module.nat_gateway.azurerm_public_ip.this["default"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip-nat-crv-githublab-demo-dev]
module.log_analytics_workspace.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev]
module.nat_gateway.azurerm_nat_gateway.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/natGateways/nat-crv-githublab-demo-dev]
module.network_security_group.azurerm_network_security_rule.this["no_internet"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev/securityRules/block-internet-traffic]
module.nat_gateway.azurerm_nat_gateway_public_ip_association.this["default"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/natGateways/nat-crv-githublab-demo-dev|/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip-nat-crv-githublab-demo-dev]
module.virtual_network.module.subnet["AzureBastionSubnet"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet]
module.virtual_network.module.subnet["virtual_machines"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines]
module.virtual_network.module.subnet["private_endpoints"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints]
module.virtual_network.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev|sendToLogAnalytics]
module.network_security_group.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev|sendToLogAnalytics]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.nat_gateway.azurerm_nat_gateway.this has changed
  ~ resource "azurerm_nat_gateway" "this" {
        id                      = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/natGateways/nat-crv-githublab-demo-dev"
        name                    = "nat-crv-githublab-demo-dev"
      + tags                    = {}
      + zones                   = []
        # (5 unchanged attributes hidden)
    }

  # module.network_security_group.azurerm_network_security_group.this has changed
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev"
        name                = "nsg-crv-githublab-demo-dev"
      ~ security_rule       = [
          + {
              + access                                     = "Deny"
              + destination_address_prefix                 = "Internet"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "block-internet-traffic"
              + priority                                   = 100
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
        tags                = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (2 unchanged attributes hidden)
    }

  # module.virtual_network.azapi_resource.vnet has changed
  ~ resource "azapi_resource" "vnet" {
      ~ body                      = {
          ~ properties       = {
              ~ dhcpOptions          = null -> {
                  + dnsServers = []
                }
                # (7 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
        name                      = "vnet-crv-githublab-demo-dev"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
          ~ properties = {
              + subnets           = [
                  + {
                      + properties = {
                          + provisioningState = "Succeeded"
                        }
                    },
                  + {
                      + properties = {
                          + provisioningState = "Succeeded"
                        }
                    },
                  + {
                      + properties = {
                          + provisioningState = "Succeeded"
                        }
                    },
                ]
                # (3 unchanged attributes hidden)
            }
            tags       = {
                env  = "demo"
                type = "avm"
            }
            # (1 unchanged attribute hidden)
        }
        tags                      = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["AzureBastionSubnet"].azapi_resource.subnet has changed
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = null -> "10.0.1.0/26"
              ~ networkSecurityGroup              = null -> {
                  + id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/vnet-crv-githublab-demo-dev-AzureBastionSubnet-nsg-canadacentral"
                }
              ~ serviceEndpoints                  = null -> []
                # (9 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
        name                      = "AzureBastionSubnet"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
          ~ properties = {
              - addressPrefixes   = [
                  - "10.0.1.0/26",
                ]
                # (1 unchanged attribute hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["private_endpoints"].azapi_resource.subnet has changed
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = null -> "10.0.1.64/28"
              ~ serviceEndpoints                  = null -> []
                # (10 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
        name                      = "private_endpoints"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
          ~ properties = {
              - addressPrefixes   = [
                  - "10.0.1.64/28",
                ]
                # (1 unchanged attribute hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["virtual_machines"].azapi_resource.subnet has changed
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = null -> "10.0.0.0/24"
              ~ networkSecurityGroup              = null -> {
                  + id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/vnet-crv-githublab-demo-dev-virtual_machines-nsg-canadacentral"
                }
              ~ serviceEndpoints                  = null -> []
                # (9 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
        name                      = "virtual_machines"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
          ~ properties = {
              - addressPrefixes   = [
                  - "10.0.0.0/24",
                ]
                # (1 unchanged attribute hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.bastion_host.azurerm_bastion_host.this will be created
  + resource "azurerm_bastion_host" "this" {
      + copy_paste_enabled        = true
      + dns_name                  = (known after apply)
      + file_copy_enabled         = false
      + id                        = (known after apply)
      + ip_connect_enabled        = true
      + kerberos_enabled          = false
      + location                  = "canadacentral"
      + name                      = "bas-crv-githublab-demo-dev"
      + resource_group_name       = "rg-crv-githublab-demo-dev"
      + scale_units               = 2
      + session_recording_enabled = false
      + shareable_link_enabled    = true
      + sku                       = "Standard"
      + tags                      = {
          + "env"  = "demo"
          + "type" = "avm"
        }
      + tunneling_enabled         = true

      + ip_configuration {
          + name                 = "ipconfig"
          + public_ip_address_id = (known after apply)
          + subnet_id            = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
        }
    }

  # module.bastion_host.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
      + name                           = "sendToLogAnalytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.bastion_host.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-bastionhost/azurerm"
          + "module_version"  = "0.4.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400"
          + "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
        }
    }

  # module.bastion_host.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.bastion_host_public_ip.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
      + name                           = "sendToLogAnalytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.bastion_host_public_ip.azurerm_public_ip.this will be created
  + resource "azurerm_public_ip" "this" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "canadacentral"
      + name                    = "pip--crv-githublabbas-demo-dev"
      + resource_group_name     = "rg-crv-githublab-demo-dev"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "env"  = "demo"
          + "type" = "avm"
        }
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.bastion_host_public_ip.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-publicipaddress/azurerm"
          + "module_version"  = "0.2.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400"
          + "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
        }
    }

  # module.bastion_host_public_ip.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.key_vault.azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "canadacentral"
      + name                            = "kvcrv-githublabdemodev"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "rg-crv-githublab-demo-dev"
      + sku_name                        = "premium"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "env"  = "demo"
          + "type" = "avm"
        }
      + tenant_id                       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # module.key_vault.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
      + name                           = "sendToLogAnalytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.key_vault.azurerm_private_endpoint.this["primary"] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "canadacentral"
      + name                     = "pe-kvcrv-githublabdemodev"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-crv-githublab-demo-dev"
      + subnet_id                = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
      + tags                     = {
          + "env"  = "demo"
          + "type" = "avm"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "pse-kvcrv-githublabdemodev"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.key_vault.azurerm_role_assignment.this["customer_managed_key"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Service Encryption User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = false
    }

  # module.key_vault.azurerm_role_assignment.this["deployment_user_secrets"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6a45ce14-9eee-423b-a17e-4f880c8eaecc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = false
    }

  # module.key_vault.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-keyvault-vault/azurerm"
          + "module_version"  = "0.9.1"
          + "random_id"       = (known after apply)
          + "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400"
          + "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
        }
    }

  # module.key_vault.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.key_vault.time_sleep.wait_for_rbac_before_key_operations[0] will be created
  + resource "time_sleep" "wait_for_rbac_before_key_operations" {
      + create_duration  = "60s"
      + destroy_duration = "0s"
      + id               = (known after apply)
      + triggers         = {
          + "role_assignments" = (known after apply)
        }
    }

  # module.network_security_group.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "this" {
        id                             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev|sendToLogAnalytics"
      + log_analytics_destination_type = "Dedicated"
        name                           = "sendToLogAnalytics"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.private_dns_zone_key_vault.azurerm_private_dns_zone.this will be created
  + resource "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-crv-githublab-demo-dev"
      + tags                                                  = {
          + "env"  = "demo"
          + "type" = "avm"
        }

      + soa_record (known after apply)

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.private_dns_zone_key_vault.azurerm_private_dns_zone_virtual_network_link.this["vnetlink1"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "this" {
      + id                    = (known after apply)
      + name                  = "key-vault"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-crv-githublab-demo-dev"
      + virtual_network_id    = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.private_dns_zone_key_vault.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-privatednszone/azurerm"
          + "module_version"  = "0.3.2"
          + "random_id"       = (known after apply)
          + "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400"
          + "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
        }
    }

  # module.private_dns_zone_key_vault.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.private_dns_zone_storage_account.azurerm_private_dns_zone.this will be created
  + resource "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-crv-githublab-demo-dev"
      + tags                                                  = {
          + "env"  = "demo"
          + "type" = "avm"
        }

      + soa_record (known after apply)

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.private_dns_zone_storage_account.azurerm_private_dns_zone_virtual_network_link.this["vnetlink1"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "this" {
      + id                    = (known after apply)
      + name                  = "storage-account"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-crv-githublab-demo-dev"
      + virtual_network_id    = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.private_dns_zone_storage_account.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-privatednszone/azurerm"
          + "module_version"  = "0.3.2"
          + "random_id"       = (known after apply)
          + "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400"
          + "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
        }
    }

  # module.private_dns_zone_storage_account.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.storage_account.azapi_resource.containers["demo"] will be created
  + resource "azapi_resource" "containers" {
      + body                      = {
          + properties = {
              + immutableStorageWithVersioning = null
              + metadata                       = {}
              + publicAccess                   = "None"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "demo"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = false
      + type                      = "Microsoft.Storage/storageAccounts/blobServices/containers@2023-01-01"
    }

  # module.storage_account.azurerm_monitor_diagnostic_setting.blob["sendToLogAnalytics"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "blob" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
      + name                           = "sendToLogAnalytics"
      + target_resource_id             = (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.storage_account.azurerm_monitor_diagnostic_setting.storage_account["sendToLogAnalytics"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "storage_account" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
      + name                           = "sendToLogAnalytics"
      + target_resource_id             = (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.storage_account.azurerm_private_endpoint.this["primary"] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "canadacentral"
      + name                     = "pe-sacrvgithublabdemodev"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-crv-githublab-demo-dev"
      + subnet_id                = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
      + tags                     = {
          + "env"  = "demo"
          + "type" = "avm"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "pse-sacrvgithublabdemodev"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.storage_account.azurerm_role_assignment.containers["demo-contributor"] will be created
  + resource "azurerm_role_assignment" "containers" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = false
    }

  # module.storage_account.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = true
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "canadacentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = "sacrvgithublabdemodev"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-crv-githublab-demo-dev"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "env"  = "demo"
          + "type" = "avm"
        }

      + blob_properties (known after apply)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned, UserAssigned"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.storage_account.azurerm_storage_account_customer_managed_key.this[0] will be created
  + resource "azurerm_storage_account_customer_managed_key" "this" {
      + id                        = (known after apply)
      + key_name                  = (known after apply)
      + key_vault_id              = (known after apply)
      + key_vault_uri             = (known after apply)
      + storage_account_id        = (known after apply)
      + user_assigned_identity_id = (known after apply)
    }

  # module.storage_account.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-storage-storageaccount/azurerm"
          + "module_version"  = "0.5.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400"
          + "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
        }
    }

  # module.storage_account.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.user_assigned_managed_identity.azurerm_user_assigned_identity.this will be created
  + resource "azurerm_user_assigned_identity" "this" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "uami-crv-githublab-demo-dev"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-crv-githublab-demo-dev"
      + tags                = {
          + "env"  = "demo"
          + "type" = "avm"
        }
      + tenant_id           = (known after apply)
    }

  # module.user_assigned_managed_identity.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-managedidentity-userassignedidentity/azurerm"
          + "module_version"  = "0.3.3"
          + "random_id"       = (known after apply)
          + "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400"
          + "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
        }
    }

  # module.user_assigned_managed_identity.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.virtual_machine.data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.virtual_machine.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/virtual_machine"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.virtual_machine.azurerm_key_vault_secret.admin_ssh_key[0] will be created
  + resource "azurerm_key_vault_secret" "admin_ssh_key" {
      + content_type            = "text/plain"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vm-crv-githublab-demo-dev-azureuser-ssh-private-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.virtual_machine.azurerm_linux_virtual_machine.this[0] will be created
  + resource "azurerm_linux_virtual_machine" "this" {
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "vm-crv-githublab-demo-dev"
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "canadacentral"
      + max_bid_price                                          = -1
      + name                                                   = "vm-crv-githublab-demo-dev"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-crv-githublab-demo-dev"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "env"  = "demo"
          + "type" = "avm"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false
      + zone                                                   = "1"

      + admin_ssh_key {
          + public_key = (known after apply)
          + username   = "azureuser"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.virtual_machine.azurerm_monitor_diagnostic_setting.this_vm_diags["sendToLogAnalytics"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "this_vm_diags" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
      + name                           = "sendToLogAnalytics"
      + target_resource_id             = (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.virtual_machine.azurerm_network_interface.virtualmachine_network_interfaces["private"] will be created
  + resource "azurerm_network_interface" "virtualmachine_network_interfaces" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "canadacentral"
      + mac_address                    = (known after apply)
      + name                           = "nic-crv-githublab-demo-dev"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-crv-githublab-demo-dev"
      + tags                           = {
          + "env"  = "demo"
          + "type" = "avm"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "private"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
        }
    }

  # module.virtual_machine.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.virtual_machine.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.virtual_machine.tls_private_key.this[0] will be created
  + resource "tls_private_key" "this" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.virtual_network.azapi_resource.vnet will be updated in-place
  ~ resource "azapi_resource" "vnet" {
      ~ body                      = {
          ~ properties       = {
              ~ dhcpOptions          = {
                  - dnsServers = []
                } -> null
                # (7 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
        name                      = "vnet-crv-githublab-demo-dev"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
          - properties = {
              - addressSpace      = {
                  - addressPrefixes = [
                      - "10.0.0.0/22",
                    ]
                }
              - provisioningState = "Succeeded"
              - resourceGuid      = "ad603c91-df95-4429-a48d-159f94fb2d47"
              - subnets           = [
                  - {
                      - properties = {
                          - provisioningState = "Succeeded"
                        }
                    },
                  - {
                      - properties = {
                          - provisioningState = "Succeeded"
                        }
                    },
                  - {
                      - properties = {
                          - provisioningState = "Succeeded"
                        }
                    },
                ]
            }
          - tags       = {
              - env  = "demo"
              - type = "avm"
            }
          - type       = "Microsoft.Network/virtualNetworks"
        } -> (known after apply)
        tags                      = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (6 unchanged attributes hidden)
    }

  # module.key_vault.module.keys["cmk_for_storage_account"].azurerm_key_vault_key.this will be created
  + resource "azurerm_key_vault_key" "this" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = "cmk-for-storage-account"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # module.virtual_network.module.subnet["AzureBastionSubnet"].azapi_resource.subnet will be updated in-place
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = "10.0.1.0/26" -> null
              ~ networkSecurityGroup              = {
                  - id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/vnet-crv-githublab-demo-dev-AzureBastionSubnet-nsg-canadacentral"
                } -> null
              ~ serviceEndpoints                  = [] -> null
                # (9 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
        name                      = "AzureBastionSubnet"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
          - properties = {
              - provisioningState = "Succeeded"
            }
          - type       = "Microsoft.Network/virtualNetworks/subnets"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["private_endpoints"].azapi_resource.subnet will be updated in-place
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = "10.0.1.64/28" -> null
              ~ serviceEndpoints                  = [] -> null
                # (10 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
        name                      = "private_endpoints"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
          - properties = {
              - provisioningState = "Succeeded"
            }
          - type       = "Microsoft.Network/virtualNetworks/subnets"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["virtual_machines"].azapi_resource.subnet will be updated in-place
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = "10.0.0.0/24" -> null
              ~ networkSecurityGroup              = {
                  - id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/vnet-crv-githublab-demo-dev-virtual_machines-nsg-canadacentral"
                } -> null
              ~ serviceEndpoints                  = [] -> null
                # (9 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
        name                      = "virtual_machines"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
          - properties = {
              - provisioningState = "Succeeded"
            }
          - type       = "Microsoft.Network/virtualNetworks/subnets"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 44 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  ~ resource_ids   = {
      + bastion_host                   = (known after apply)
      + bastion_host_public_ip         = (known after apply)
      + key_vault                      = (known after apply)
      + network_interface              = (known after apply)
      + storage_account                = (known after apply)
      + user_assigned_managed_identity = (known after apply)
      + virtual_machine                = (known after apply)
        # (6 unchanged attributes hidden)
    }
  ~ resource_names = {
      + bastion_host_name                   = "bas-crv-githublab-demo-dev"
      + bastion_host_public_ip_name         = "pip--crv-githublabbas-demo-dev"
      + key_vault_name                      = "kvcrv-githublabdemodev"
      + network_interface_name              = "nic-crv-githublab-demo-dev"
      + storage_account_name                = "sacrvgithublabdemodev"
      + user_assigned_managed_identity_name = "uami-crv-githublab-demo-dev"
      + virtual_machine_name                = "vm-crv-githublab-demo-dev"
        # (6 unchanged attributes hidden)
    }
  + subnets        = {
      + AzureBastionSubnet = {
          + address_prefixes       = [
              + "10.0.1.0/26",
            ]
          + name                   = "AzureBastionSubnet"
          + nat_gateway            = null
          + network_security_group = null
        }
      + private_endpoints  = {
          + address_prefixes       = [
              + "10.0.1.64/28",
            ]
          + name                   = "private_endpoints"
          + nat_gateway            = null
          + network_security_group = {
              + id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev"
            }
        }
      + virtual_machines   = {
          + address_prefixes       = [
              + "10.0.0.0/24",
            ]
          + name                   = "virtual_machines"
          + nat_gateway            = {
              + id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/natGateways/nat-crv-githublab-demo-dev"
            }
          + network_security_group = null
        }
    }

Warning: Argument is deprecated

  with module.virtual_machine.azurerm_linux_virtual_machine.this[0],
  on .terraform/modules/virtual_machine/main.linux_vm.tf line 41, in resource "azurerm_linux_virtual_machine" "this":
  41:   vm_agent_platform_updates_enabled                      = var.vm_agent_platform_updates_enabled

this property has been deprecated due to a breaking change introduced by the
Service team, which redefined it as a read-only field within the API

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @ch-rob, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*